{
  "ECE 1": {
    "name": "Hands-On Computer Engineering",
    "credits": 2,
    "label": "ECE",
    "id": "1",
    "genEd": "null",
    "description": "Hands-on introduction to computer engineering practice and research, including computer hardware, robotics, and embedded systems. Encourages interaction with UCSC's School of Engineering community. Designed for students without previous background in computer engineering. (Formerly Computer Engineering 1.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Robotics"
  },
  "ECE 8": {
    "name": "Robot Automation: Intelligence through Feedback Control",
    "credits": 5,
    "label": "ECE",
    "id": "8",
    "genEd": "MF",
    "description": "Introduction to dynamical systems, feedback control, and robotics. Fundamental concepts in dynamical systems, modeling, stability analysis, robustness to uncertainty, feedback as it occurs naturally, and the design of feedback-control laws to engineer desirable static and dynamic response. Course includes an introduction to MATLAB and programming in MATLAB.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Robotics"
  },
  "ECE 9": {
    "name": "Statics and Mechanics of Materials",
    "credits": 5,
    "label": "ECE",
    "id": "9",
    "genEd": "null",
    "description": "Theory and application of statics and mechanics of materials for mechanical and biomechanical systems. Covers statics of particles; equilibrium of rigid bodies; free-body diagrams; analysis of structure; friction; concepts of stress and strain; axial loading; torsion and bending; and failure criteria. (Formerly Introduction to Statics, Dynamics, and Biomechanics.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "MATH 19A",
        {
          "OR": [
            {
              "AND": [
                "PHYS 5A",
                "PHYS 5L"
              ]
            },
            {
              "AND": [
                "PHYS 6A",
                "PHYS 6L"
              ]
            }
          ]
        },
        {
          "OR": [
            "AM 10",
            "MATH 21"
          ]
        }
      ]
    },
    "concentration": "Mechanical Engineering"
  },
  "ECE 10": {
    "name": "Fundamentals of Robot Kinematics and Dynamics",
    "credits": 5,
    "label": "ECE",
    "id": "10",
    "genEd": "null",
    "description": "Covers the theory and application of mathematical models to analyze the kinematics and dynamics of robot mechanisms or their components using vector algebra, differential equations, and computer simulations; also covers robot vehicle kinematics, robot arm kinematics, and robot dynamics with computational examples and problems. Some basic programming skills and familiarity with MATLAB are expected. (Formerly CMPE 10.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 9",
        {
          "OR": [
            "AM 20",
            "MATH 24"
          ]
        }
      ]
    },
    "concentration": "Robotics"
  },
  "ECE 11": {
    "name": "3D Prototyping",
    "credits": 5,
    "label": "ECE",
    "id": "11",
    "genEd": "null",
    "description": "Introduces the basics of rapid prototyping for robotics design from limiting stresses to optimal design. Discusses fast prototyping methods, advantages, and disadvantages. Introduces CAD, CAD packages, 3D printing with different materials, and 3D scanning. (Formerly CMPE 11.)",
    "concurrent": "null",
    "prerequisites": "ECE 9",
    "concentration": "Robotics"
  },
  "ECE 13": {
    "name": "Computer Systems and C Programming",
    "credits": 7,
    "label": "ECE",
    "id": "13",
    "genEd": "null",
    "description": "Computer Systems and C Programming is intended to bring students up to speed on programming small and large programs in C. Originally written in 1978, C remains the most popular programming language, and the most used one in terms of numbers of computer programs written in it. The course approaches C from an embedded paradigm, and all programming assignments are on a 32-bit embedded micro, the Microchip PIC32. Students learn how to program in C, how to write modular code, and some of the tips and tricks when dealing with an embedded micro. This is a programming class and students will write lots of code. Expect to spend at least 15-20 hours outside of class playing with the code to get things to work. (Formerly CSE 13E Embedded Systems and C Programming)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "CSE 12",
        {
          "OR": [
            "CSE 20",
            "CSE 30"
          ]
        }
      ]
    },
    "concentration": "Embedded Systems"
  },
  "ECE 30": {
    "name": "Engineering Principles of Electronics",
    "credits": 5,
    "label": "ECE",
    "id": "30",
    "genEd": "SI",
    "description": "Suitable for sophomores pursuing computer science and engineering careers. Aims at deriving basic engineering principles directly from examples relevant to computing and electronics: 1) Newton's Laws and related fundamental mechanics; 2) basic thermodynamics and heat/energy transfer; 3) key electromagnetic principles, including Coulomb's Law, Gauss's Law, and basic circuit analysis using Kirchoff's Laws/Rules; and 4) Ray optics for fiber optic communications and camera electronics.",
    "concurrent": "null",
    "prerequisites": "MATH 19B",
    "concentration": "Electrical Engineering"
  },
  "ECE 80B": {
    "name": "Engineering Innovations for Medicine and Natural Sciences",
    "credits": 5,
    "label": "ECE",
    "id": "80B",
    "genEd": "SI",
    "description": "Introduces to a lay audience engineering innovations that have had an impact in medicine and biology. Course is designed for non-engineering majors, or pre-med students, as well as pre-engineering to provide a broad understanding of how technology has improved and keeps on improving healthcare.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Biomedical Engineering"
  },
  "ECE 80G": {
    "name": "Creating and Financing a Sustainable Startup in the Global Economy",
    "credits": 5,
    "label": "ECE",
    "id": "80G",
    "genEd": "CC",
    "description": "Introduces students and prospective entrepreneurs to the ingredients required to successfully create and finance a sustainability-minded startup or nonprofit in the global economy. Emphasis is placed on ethical business practice, tools for understanding markets and supply chains, and building value for all stakeholders, including communities and the environment.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Entrepreneurship"
  },
  "ECE 80H": {
    "name": "Bending the Curve: Solutions to Climate Change",
    "credits": 5,
    "label": "ECE",
    "id": "80H",
    "genEd": "PE-H",
    "description": "Students examine the interconnectedness of natural and social systems as they evaluate, interpret, and debate evidence and explanations of climate change. Includes interviewing family members, friends, and professionals for a variety of divergent views on the climate change debate. Class sessions are devoted to student discussion of the course materials, including readings, take-home assignments and pre-recorded videos. The class culminates with a written proposal and group presentations of ideas for solutions, with the guidance of the instructor, addressing one of the grand challenges presented in the course with the goal of empowering students to emerge as critical thinkers and actors equipped with a solution-based mindset.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Environmental Engineering"
  },
  "ECE 80E": {
    "name": "Engineering Ethics",
    "credits": 5,
    "label": "ECE",
    "id": "80E",
    "genEd": "PE-T",
    "description": "Ethical theories, analysis, and their application to issues in the practice of engineering, such as safety and liability, professional responsibility to clients and employers, codes of ethics, legal obligations, environmental issues, and social issues. Emphasis on developing independent ethical analysis through the use of case studies. (Formerly CMPE 80E.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Ethics in Engineering"
  },
  "ECE 80J": {
    "name": "Renewable Energy Sources, Storage, and Smart Grids",
    "credits": 5,
    "label": "ECE",
    "id": "80J",
    "genEd": "PE-E",
    "description": "Introduces energy sources and storage with special emphasis on renewables as part of smart grids. Fundamental energy-conversion limits based on physics and existing source properties are studied. Various sources, such as solar, wind, hydropower, geothermal, tidal energy, and fuel cells are described. Electric vehicles, sustainable microgrids, and the integration to smart grids are studied. Finally, smart meters, demand response, the energy market, and policy are covered. Students cannot receive credit for this course and course 81J. (Formerly EE 80J.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Renewable Energy"
  },
  "ECE 80S": {
    "name": "Sustainability Engineering and Practice",
    "credits": 5,
    "label": "ECE",
    "id": "80S",
    "genEd": "SR",
    "description": "Topical introduction to principles and practices of sustainability engineering and ecological design with emphasis on implementation in society. Provides an understanding of basic scientific, engineering, and social principles in the design, deployment, and operation of resource-based human systems, and how they can be maintained for this and future generations. No specialized background in engineering, science, or social sciences is assumed. (Formerly EE 80S.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Sustainability Engineering"
  },
  "ECE 80T": {
    "name": "Modern Electronic Technology and How It Works",
    "credits": 5,
    "label": "ECE",
    "id": "80T",
    "genEd": "SI",
    "description": "Basic knowledge of electricity and how things work, how technology evolves, its impact on society and history, and basic technical literacy for the non-specialist. Broad overview of professional aspects of engineering and introduction and overview of basic systems and components. Topics include electrical power, radio, television, radar, computers, robots, telecommunications, and the Internet. (Formerly EE 80T.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Introduction to Engineering"
  },
  "ECE 94": {
    "name": "Group Tutorial",
    "credits": 5,
    "label": "ECE",
    "id": "94",
    "genEd": "null",
    "description": "A means for a small group of students to study a particular topic in consultation with a faculty sponsor. Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Interdisciplinary Studies"
  },
  "ECE 94F": {
    "name": "Group Tutorial",
    "credits": 2,
    "label": "ECE",
    "id": "94F",
    "genEd": "null",
    "description": "A means for a small group of students to study a particular topic in consultation with a faculty sponsor. Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Interdisciplinary Studies"
  },
  "ECE 99": {
    "name": "Tutorial",
    "credits": 5,
    "label": "ECE",
    "id": "99",
    "genEd": "null",
    "description": "Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Interdisciplinary Studies"
  },
  "ECE 99F": {
    "name": "Tutorial",
    "credits": 2,
    "label": "ECE",
    "id": "99F",
    "genEd": "null",
    "description": "Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Interdisciplinary Studies"
  },
  "ECE 101": {
    "name": "Introduction to Electronic Circuits",
    "credits": 5,
    "label": "ECE",
    "id": "101",
    "genEd": "null",
    "description": "Introduction to the physical basis and mathematical models of electrical components and circuits. Topics include circuit theorems (Thevenin and Norton Equivalents, Superposition), constant and sinusoidal inputs, natural and forced response of linear circuits. Introduction to circuit/network design, maximum power transfer, analog filters, and circuit analysis using Matlab. Topics in elementary electronics including amplifiers and feedback. (Formerly EE 101.)",
    "concurrent": "ECE 101L",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            {
              "AND": [
                "PHYS 5C",
                "PHYS 5N"
              ]
            },
            {
              "AND": [
                "PHYS 6C",
                "PHYS 6N"
              ]
            }
          ]
        },
        {
          "OR": [
            "MATH 24",
            "AM 20"
          ]
        }
      ]
    },
    "concentration": "Electrical Engineering"
  },
  "ECE 101L": {
    "name": "Introduction to Electronic Circuits Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "101L",
    "genEd": "null",
    "description": "Illustrates topics covered in ECE 101. One two-hour laboratory session per week.",
    "concurrent": "ECE 101",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            {
              "AND": [
                "PHYS 5C",
                "PHYS 5N"
              ]
            },
            {
              "AND": [
                "PHYS 6C",
                "PHYS 6N"
              ]
            }
          ]
        },
        {
          "OR": [
            "MATH 24",
            "AM 20"
          ]
        }
      ]
    },
    "concentration": "Electrical Engineering"
  },
  "ECE 102": {
    "name": "Properties of Materials",
    "credits": 5,
    "label": "ECE",
    "id": "102",
    "genEd": "null",
    "description": "The fundamental electrical, optical, and magnetic properties of materials, with emphasis on metals and semiconductors: chemical bonds, crystal structures, elementary quantum mechanics, energy bands. Electrical and thermal conduction. Optical and magnetic properties. (Formerly EE 145.)",
    "concurrent": "ECE 102L",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            {
              "AND": [
                "PHYS 5A",
                "PHYS 5B",
                "PHYS 5C",
                "PHYS 5L",
                "PHYS 5M",
                "PHYS 5N"
              ]
            },
            {
              "AND": [
                "PHYS 6A",
                "PHYS 6B",
                "PHYS 6C",
                "PHYS 6L",
                "PHYS 6M",
                "PHYS 6N"
              ]
            }
          ]
        }
      ]
    },
    "concentration": "Material Science"
  },
  "ECE 102L": {
    "name": "Properties of Materials Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "102L",
    "genEd": "null",
    "description": "Laboratory sequence illustrating topics covered in course 145. One two-hour laboratory per week.",
    "concurrent": "ECE 102",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            {
              "AND": [
                "PHYS 5A",
                "PHYS 5B",
                "PHYS 5C",
                "PHYS 5L",
                "PHYS 5M",
                "PHYS 5N"
              ]
            },
            {
              "AND": [
                "PHYS 6A",
                "PHYS 6B",
                "PHYS 6C",
                "PHYS 6L",
                "PHYS 6M",
                "PHYS 6N"
              ]
            }
          ]
        }
      ]
    },
    "concentration": "Material Science"
  },
  "ECE 103": {
    "name": "Signals and Systems",
    "credits": 5,
    "label": "ECE",
    "id": "103",
    "genEd": "null",
    "description": "Course covers the following topics: characterization and analysis of continuous-time signals and linear systems, time domain analysis using convolution, frequency domain analysis using the Fourier series and the Fourier transform, the Laplace transform, transfer functions and block diagrams, continuous-time filters, sampling of continuous time signals, examples of applications to communications and control systems. (Formerly EE 103.)",
    "concurrent": "ECE 103L",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L",
        {
          "OR": [
            "AM 20",
            "MATH 24"
          ]
        }
      ]
    },
    "concentration": "Signal Processing"
  },
  "ECE 103L": {
    "name": "Signals and Systems Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "103L",
    "genEd": "null",
    "description": "Use and operation of spectrum analyzers; advanced signal analysis using oscilloscopes; measuring impulse response, step response, frequency response, and computer analysis of real signals. MATLAB programming is taught and used as a tool for signal analysis. Students are billed a materials fee. (Formerly EE 103L.)",
    "concurrent": "ECE 103",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L",
        {
          "OR": [
            "AM 20",
            "MATH 24"
          ]
        }
      ]
    },
    "concentration": "Signal Processing"
  },
  "ECE 104": {
    "name": "Bioelectronics",
    "credits": 5,
    "label": "ECE",
    "id": "104",
    "genEd": "null",
    "description": "Covers selected case studies in interfacing electronic devices with biological systems. from Galvani to neuronal stimulation and electroceuticals. These studies include: the squid giant axon, the pace maker, deep brain stimulation, organic bioelectronics, bionanoelectronics and optogenetics, bioenergetics, and bioprotonics electroceuticals. Students are assessed through weekly student papers on case studies and through a final presentation. (Formerly EE 104.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Biomedical Engineering"
  },
  "ECE 115": {
    "name": "Introduction to Solid Mechanics",
    "credits": 5,
    "label": "ECE",
    "id": "115",
    "genEd": "null",
    "description": "Introduces the solid mechanics of materials. Topics include: stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, and statically indeterminate members and columns. (Formerly CMPE 115.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 9",
        "MATH 19B",
        {
          "OR": [
            "AM 10",
            "MATH 21"
          ]
        }
      ]
    },
    "concentration": "Mechanical Engineering"
  },
  "ECE 118": {
    "name": "Introduction to Mechatronics",
    "credits": 10,
    "label": "ECE",
    "id": "118",
    "genEd": "PR-E",
    "description": "Technologies involved in mechatronics (intelligent electro-mechanical systems) and techniques necessary to integrate these technologies into mechatronic systems. Topics include electronics (A/D, D/A converters, opamps, filters, power devices), software program design (event-driven programming, state machine-based design), DC and stepper motors, basic sensing, and basic mechanical design (machine elements and mechanical CAD). Combines lab component of structured assignments with a large and open-ended team project. Students who enrolled in this class will learn how to solve engineering problems using the C Programming Language. Cannot receive credit for this course and ECE 218.",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L",
        "CSE 100",
        "CSE 100L",
        {
          "OR": [
            "ECE 13",
            "CSE 13E"
          ]
        }
      ]
    },
    "concentration": "Mechatronics"
  },
  "ECE 121": {
    "name": "Microcontroller System Design",
    "credits": 7,
    "label": "ECE",
    "id": "121",
    "genEd": "null",
    "description": "Focus is on the design and use of microcontroller-based embedded systems, specifically addressing issues of low-level functionality, direct manipulation of input/output using various specialized peripheral sets, and multiple communications protocols. Covers timers, Input Capture, Output Compare, ADC, PWM, interrupts, bus and memory organization, DMA, SPI, I2C, device driver programming, serial packet communication, and clocking. Students enrolled in this class learn how to use the C programming language to solve engineering problems.",
    "concurrent": "ECE 101",
    "prerequisites": {
      "AND": [
        "CSE 12",
        {
          "OR": [
            "ECE 13",
            "CSE 13E"
          ]
        }
      ]
    },
    "concentration": "Embedded Systems"
  },
  "ECE 122A": {
    "name": "Collaborative Sustainability Project Design",
    "credits": 5,
    "label": "ECE",
    "id": "122A",
    "genEd": "null",
    "description": "This course is the first quarter of a three quarter series of courses that together comprise the IDEASS Program (Impact Designs: Engineering and Sustainability through Student Service), which provides students with opportunities to plan, implement, and evaluate interdisciplinary sustainable design projects in the built environment for the Monterey Bay Region. In fall quarter students are introduced to project topics and background information. In collaboration with an outside mentor project teams design, revise, and complete a project plan including project goals and deliverables, timeline of key activities and major milestones, stakeholder map, evaluation plan, and budget (as applicable). Students apply online; selected applicants complete in-person interviews. (Formerly EE 122A.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Sustainability Engineering"
  },
  "ECE 122B": {
    "name": "Collaborative Sustainability Project Implementation",
    "credits": 5,
    "label": "ECE",
    "id": "122B",
    "genEd": "null",
    "description": "The second of a three-quarter sequence that together comprise the IDEASS Program (Impact Designs: Engineering and Sustainability through Student Service) which provides opportunities for students to plan, implement, and evaluate interdisciplinary sustainable-design projects in the built environment for the Monterey Bay Region. In winter quarter, project teams work collaboratively to implement the project plans approved during the fall quarter. Students participate in a weekly seminary series that includes guest lectures and field trips as well as workshops in project management, public speaking, writing skills, and other professional development. Prerequisite(s): ECE 122A. Students apply online; selected applicants complete in-person interviews. Enrollment is restricted to juniors and seniors. (Formerly EE 122B.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Sustainability Engineering"
  },
  "ECE 122C": {
    "name": "Collaborative Sustainability Project Implementation",
    "credits": 5,
    "label": "ECE",
    "id": "122C",
    "genEd": "null",
    "description": "The third of a three-quarter sequence that together comprise the IDEASS Program (Impact Designs: Engineering and Sustainability through Student Service) which provides opportunities for students to plan, implement, and evaluate interdisciplinary sustainable-design projects in the built environment for the Monterey Bay Region. In spring quarter, project teams work collaboratively to continue implementation of project plans approved during the fall quarter, then evaluate projects impacts. Students participate in a weekly seminary series that includes guest lectures and field trips as well as workshops in project management, public speaking, writing skills, and other professional development. Students also work in the community on educational public outreach regarding project impacts. Prerequisite(s): ECE 122A. Students apply online; selected applicants complete in-person interviews. Enrollment is restricted to juniors and seniors. (Formerly EE 122C.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Sustainability Engineering"
  },
  "ECE 129A": {
    "name": "Capstone Project I",
    "credits": 5,
    "label": "ECE",
    "id": "129A",
    "genEd": "null",
    "description": "First of a three-course sequence in which students apply knowledge and skills gained in elective track to complete a major design project. In this first course, students complete the specification and planning for a substantial project. Topics covered: engineering design cycle, engineering teams, and professional practices. (Formerly EE 129A.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "WRIT 1",
        "WRIT 2",
        "CSE 100",
        {
          "OR": [
            {
              "AND": [
                "ECE 118",
                "ECE 121"
              ]
            },
            {
              "AND": [
                "ECE 171",
                {
                  "OR": [
                    "ECE 157",
                    "ECE 173",
                    "ECE 118",
                    "ECE 121"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "concentration": "Electrical Engineering"
  },
  "ECE 129B": {
    "name": "Capstone Project II",
    "credits": 5,
    "label": "ECE",
    "id": "129B",
    "genEd": "PR-E",
    "description": "Second of a three-course sequence in which students apply knowledge and skills gained in elective track to complete a major design project. In this second course, students complete the training, research, and procurement for a substantial project and a preliminary implementation.",
    "concurrent": "null",
    "prerequisites": "ECE 129A",
    "concentration": "Electrical Engineering"
  },
  "ECE 129C": {
    "name": "Capstone Project III",
    "credits": 5,
    "label": "ECE",
    "id": "129C",
    "genEd": "null",
    "description": "Third of a three-course sequence in which students apply knowledge and skills gained in this elective track to complete a major design project. In this third course, students work in teams to complete the project specified and advance on the results of the work in the first two courses. A formal written report, oral presentation, and demonstration of the successful project to a review panel of engineering faculty is required.",
    "concurrent": "null",
    "prerequisites": "ECE 129B",
    "concentration": "Electrical Engineering"
  },
  "ECE 130": {
    "name": "Introduction to Optoelectronics and Photonics",
    "credits": 5,
    "label": "ECE",
    "id": "130",
    "genEd": "null",
    "description": "Introduction to optics, photonics and optoelectronics, fiber optic devices and communication systems: Topics include: ray optics, electromagnetic optics, resonator optics, interaction between photons and atoms, dielectric waveguides and fibers, semiconductor light sources and detectors, modulators, amplifiers, switches, and optical fiber communication systems. Taught in conjunction with course 230. Students cannot receive credit for this course and ECE 230. (Formerly EE 130.)",
    "concurrent": "ECE 130L",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            {
              "AND": [
                "PHYS 5B",
                "PHYS 5C"
              ]
            },
            {
              "AND": [
                "PHYS 6B",
                "PHYS 6C"
              ]
            }
          ]
        }
      ]
    },
    "concentration": "Photonics"
  },
  "ECE 130L": {
    "name": "Introduction to Optoelectronics Laboratory",
    "credits": 1,
    "label": "ECE",
    "id": "130L",
    "genEd": "null",
    "description": "Includes a series of projects to provide hands-on experience needed for basic concepts and laboratory techniques of optical fiber technology.",
    "concurrent": "ECE 130",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            {
              "AND": [
                "PHYS 5L",
                "PHYS 5M",
                "PHYS 5N"
              ]
            },
            {
              "AND": [
                "PHYS 6L",
                "PHYS 6M",
                "PHYS 5N"
              ]
            }
          ]
        }
      ]
    },
    "concentration": "Photonics"
  },
  "ECE 135": {
    "name": "Electromagnetic Fields and Waves",
    "credits": 5,
    "label": "ECE",
    "id": "135",
    "genEd": "null",
    "description": "Vector analysis. Electrostatic fields. Magnetostatic fields. Time-varying fields and Maxwell's equations. Plane waves. (Formerly EE 135.)",
    "concurrent": "ECE 135L",
    "prerequisites": {
      "AND": [
        "MATH 24",
        "ECE 101",
        "ECE 101L",
        "MATH 23B",
        {
          "OR": [
            "MATH 24",
            "AM 20"
          ]
        }
      ]
    },
    "concentration": "Electromagnetics"
  },
  "ECE 135L": {
    "name": "Electromagnetic Fields and Waves Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "135L",
    "genEd": "null",
    "description": "Laboratory sequence illustrating topics in course 135. One two-hour laboratory session per week.",
    "concurrent": "ECE 135",
    "prerequisites": {
      "AND": [
        "MATH 24",
        "ECE 101",
        "ECE 101L",
        "MATH 23B",
        {
          "OR": [
            "MATH 24",
            "AM 20"
          ]
        }
      ]
    },
    "concentration": "Electromagnetics"
  },
  "ECE 136": {
    "name": "Engineering Electromagnetics",
    "credits": 5,
    "label": "ECE",
    "id": "136",
    "genEd": "null",
    "description": "Course will cover electromagnetic wave propagation, transmission lines, waveguides, and antennas. (Formerly EE 136.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 135",
        "ECE 135L"
      ]
    },
    "concentration": "Electromagnetics"
  },
  "ECE 141": {
    "name": "Feedback Control Systems",
    "credits": 5,
    "label": "ECE",
    "id": "141",
    "genEd": "null",
    "description": "Analysis and design of continuous linear feedback control systems. Essential principles and advantages of feedback. Design by root locus, frequency response, and state space methods and comparisons of these techniques. Applications. (Formerly CMPE 141 and EE 153.)",
    "concurrent": "null",
    "prerequisites": "ECE 103",
    "concentration": "Control Systems"
  },
  "ECE 145": {
    "name": "Estimation and Introduction to Control of Stochastic Processes",
    "credits": 5,
    "label": "ECE",
    "id": "145",
    "genEd": "SR",
    "description": "Provides practical knowledge of Kalman filtering and introduces control theory for stochastic processes. Selected topics include: state-space modeling; discrete- and continuous-time Kalman filter; smoothing; and applications in feedback control. Students learn through hands-on experience. Students cannot receive credit for this course and course 245. Enrollment by permission of instructor. (Formerly CMPE 145.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Control Systems"
  },
  "ECE 149": {
    "name": "Introduction to Cyber-physical Systems",
    "credits": 5,
    "label": "ECE",
    "id": "149",
    "genEd": "null",
    "description": "Presents the basic concepts and tools for the study of cyber-physical systems, including modeling and analysis tools for continuous-time and discrete-time systems, finite state machines, stateflow, timed and hybrid automata, concurrency, invariants, linear temporal logic, verification, and numerical simulation. Students are guided on methods for simulation and encouraged to apply them to several applications. The course is self-contained. Students are expected to have a basic background in logic circuits, programming, the mathematical modeling of dynamical systems (ECE 8 is recommended), differential equations, linear algebra, and basic calculus. Knowledge of MATLAB/Simulink is useful. Students cannot receive credit for this course and ECE 249.",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            {
              "AND": [
                "ECE 101",
                "ECE 101L"
              ]
            },
            {
              "AND": [
                "ECE 13",
                "CSE 13E"
              ]
            }
          ]
        }
      ]
    },
    "concentration": "Cyber-Physical Systems"
  },
  "ECE 151": {
    "name": "Communications Systems",
    "credits": 5,
    "label": "ECE",
    "id": "151",
    "genEd": "null",
    "description": "An introduction to communication systems. Analysis and design of communication systems based on radio, transmission lines, and fiber optics. Topics include fundamentals of analog and digital signal transmission in the context of baseband communications, including concepts such as modulation and demodulation techniques, multiplexing and multiple access, channel loss, distortion, bandwidth, signal-to-noise ratios and error control. Digital communication concepts include an introduction to sampling and quantization, transmission coding and error control. (Formerly EE 151.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 103",
        "ECE 101",
        "ECE 101L",
        {
          "OR": [
            "CSE 107",
            "STAT 131"
          ]
        }
      ]
    },
    "concentration": "Communication Systems"
  },
  "ECE 152": {
    "name": "Introduction to Wireless Communications",
    "credits": 5,
    "label": "ECE",
    "id": "152",
    "genEd": "null",
    "description": "Introduction to the principles of wireless communications systems. Wireless propagation channels and their impact on digital communications. Modulation techniques for wireless systems and their performance. Multi-antenna systems and diversity. Multicarrier and spread spectrum. Multi-access methods: FDMA, TDMA, CDMA. The structure of cellular systems. Students cannot receive credit for this course and course 252. (Formerly EE 152.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "CSE 107",
        "ECE 151"
      ]
    },
    "concentration": "Wireless Communication"
  },
  "ECE 153": {
    "name": "Digital Signal Processing",
    "credits": 5,
    "label": "ECE",
    "id": "153",
    "genEd": "null",
    "description": "Introduction to the principles of signal processing, including discrete-time signals and systems, the z-transform, sampling of continuous-time signals, transform analysis of linear time-invariant systems, structures for discrete-time systems, the discrete Fourier transform, computation of the discrete Fourier transform, and filter design techniques. Taught in conjunction with Electrical Engineering 250. Students cannot receive credit for this course and Electrical Engineering 250. (Formerly EE 153 and CMPE 153.)",
    "concurrent": "null",
    "prerequisites": "CSE 103",
    "concentration": "Signal Processing"
  },
  "ECE 157": {
    "name": "RF Hardware Design",
    "credits": 5,
    "label": "ECE",
    "id": "157",
    "genEd": "null",
    "description": "Engineering design cycle for wireless and RF systems: design, practical hardware implementation, and prototype. (Formerly EE 157.)",
    "concurrent": "ECE 157L",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L",
        "ECE 103",
        "ECE 171",
        "ECE 174"
      ]
    },
    "concentration": "RF Systems"
  },
  "ECE 157L": {
    "name": "RF Hardware Design Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "157L",
    "genEd": "null",
    "description": "Laboratory to accompany course 157, emphasizing hardware-design practice and principles applies to RF apparatus. Students design and implement a substantial final project during the last half of the course. Students are billed a materials fee of $112. (Formerly EE 157L.)",
    "concurrent": "ECE 157",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L",
        "ECE 103",
        "ECE 171",
        "ECE 174"
      ]
    },
    "concentration": "RF Systems"
  },
  "ECE 163": {
    "name": "Introduction to Small-Scale UAV Theory and Practice",
    "credits": 7,
    "label": "ECE",
    "id": "163",
    "genEd": "MF",
    "description": "Technologies involved in the modeling and simulation of small-scale unmanned aerial vehicles (UAVs) with an emphasis on control applications, from low-level flight stabilization to higher level path planning and vision-based control. Topics include coordinate frames, aerodynamics, equations of motion, full non-linear simulation, linearized dynamics models and trim states, force and moment balances for steady flight, flight controls by successive loop closure, state space control, path planning and guidance, sensors and estimation. Students enrolled in this class learn how to use the Python programming language to solve engineering problems. Taught in conjunction with ECE 263. Students cannot receive credit for this course and ECE 263.",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            "ECE 141",
            "ECE 241",
            "ECE 242"
          ]
        },
        {
          "OR": [
            "CSE 30",
            "ECE 13",
            "CSE 13E",
            "CSE 13S"
          ]
        }
      ]
    },
    "concentration": "Robotics"
  },
  "ECE 167": {
    "name": "Sensing and Sensor Technologies",
    "credits": 7,
    "label": "ECE",
    "id": "167",
    "genEd": "null",
    "description": "Introduces fundamental issues in sensing of temperature, motion, sound, light, position, etc. Sensors are integrated into a digital system using filtering, amplification, and analog-to-digital conversion. Advanced topics may include noise, temperature, and other sources of variability. Students who enrolled in this class will learn how to solve engineering problems using the C Programming Language.",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 103",
        "ECE 103L",
        {
          "OR": [
            "CSE 13E",
            "ECE 13"
          ]
        }
      ]
    },
    "concentration": "Sensors and Measurement"
  },
  "ECE 170": {
    "name": "Advanced Power Electronics",
    "credits": 5,
    "label": "ECE",
    "id": "170",
    "genEd": "null",
    "description": "Advanced topics in power electronics including SCR circuits, modulation techniques, multilevel power converters, active and current-source rectifiers, magnetic circuit design, state-space averaging, power converter controller design and stability. Taught in conjunction with ECE 270. Students cannot receive credit for this course and ECE 270.",
    "concurrent": "null",
    "prerequisites": "ECE 177",
    "concentration": "Power Electronics"
  },
  "ECE 171": {
    "name": "Analog Electronics",
    "credits": 5,
    "label": "ECE",
    "id": "171",
    "genEd": "null",
    "description": "Introduction to (semiconductor) electronic devices. Conduction of electric currents in semiconductors, the semiconductor p-n junction, the transistor. Analysis and synthesis of linear and nonlinear electronic circuits containing diodes and transistors. Biasing, small signal models, frequency response, and feedback. Operational amplifiers and integrated circuits. (Formerly EE 171.)",
    "concurrent": "ECE 171L",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L"
      ]
    },
    "concentration": "Semiconductor Devices"
  },
  "ECE 171L": {
    "name": "Analog Electronics Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "171L",
    "genEd": "null",
    "description": "Laboratory sequence illustrating topics covered in course 171. One two-hour laboratory session per week.",
    "concurrent": "ECE 171",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L"
      ]
    },
    "concentration": "Semiconductor Devices"
  },
  "ECE 172": {
    "name": "Advanced Analog Circuits",
    "credits": 5,
    "label": "ECE",
    "id": "172",
    "genEd": "null",
    "description": "Analog circuit design covering the basic amplifier configurations, current mirrors, differential amplifiers, frequency response, feedback amplifiers, noise, bandgap references, one- and two-stage operational amplifier design, feedback amplifier stability, switched capacitor circuits and optionally the fundamentals of digital-to-analog and analog-to-digital converters. Emphasis throughout will be on the development of approximate and intuitive methods for understanding and designing circuits. Cannot receive credit for this course and course 221. (Formerly EE 172.)",
    "concurrent": "null",
    "prerequisites": "ECE 171",
    "concentration": "Analog Circuit Design"
  },
  "ECE 173": {
    "name": "High-Speed Digital Design",
    "credits": 7,
    "label": "ECE",
    "id": "173",
    "genEd": "null",
    "description": "Studies of analog circuit principles relevant to high-speed digital design: signal propagation, crosstalk, and electromagnetic interference. Topics include electrical characteristics of digital circuits, interfacing different logic families, measurement techniques, distributed circuits and transmission lines, ground planes and grounding, terminations, power systems, electromagnetic compatibility and noise suppression. Laboratory sequence illustrates fundamental lecture topics and includes completion of a final design project.",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L",
        "ECE 174"
      ]
    },
    "concentration": "Digital Design"
  },
  "ECE 174": {
    "name": "Introduction to EDA Tools for PCB Design",
    "credits": 3,
    "label": "ECE",
    "id": "174",
    "genEd": "null",
    "description": "Focus on EDA tools for design of printed-circuit boards. Elements of design flow covered: schematic capture and simulation to final PCB layout. Final project is required. Students are billed a materials fee.",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 101",
        "ECE 101L"
      ]
    },
    "concentration": "Printed-Circuit Board Design"
  },
  "ECE 175": {
    "name": "Energy Generation and Control",
    "credits": 5,
    "label": "ECE",
    "id": "175",
    "genEd": "null",
    "description": "Introduces electrical energy generation, sensing, and control, emphasizing the emerging smart grid. Topics include 3-phase AC power systems, voltage and transient stability, fault analysis, grid protection, power-flow analysis, economic dispatch, and high voltage DC distribution (HVDC). (Formerly EE 175.)",
    "concurrent": "ECE 175L",
    "prerequisites": "ECE 101",
    "concentration": "Power Systems"
  },
  "ECE 175L": {
    "name": "Energy Generation and Control Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "175L",
    "genEd": "null",
    "description": "Computer analysis and simulation of energy generation, components, power-flow analysis, systems, and control covering topics from course 195. Weekly computer simulations reinforce the concepts introduced in course 175. (Formerly EE 175L.)",
    "concurrent": "ECE 175",
    "prerequisites": "ECE 101",
    "concentration": "Power Systems"
  },
  "ECE 176": {
    "name": "Energy Conservation and Control",
    "credits": 5,
    "label": "ECE",
    "id": "176",
    "genEd": "null",
    "description": "AC/DC electric-machine drives for speed/position control. Integrated discussion of electric machines, power electronics, and control systems. Computer simulations. Applications in electric transportation, hybrid-car technology, robotics, process control, and energy conservation. (Formerly EE 176.)",
    "concurrent": "ECE 176L",
    "prerequisites": {
      "AND": [
        "ECE 103",
        "ECE 171"
      ]
    },
    "concentration": "Electric Machine Drives"
  },
  "ECE 176L": {
    "name": "Energy Conversion and Control Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "176L",
    "genEd": "null",
    "description": "Simulink-based simulations of electric machines/drives in applications such as energy conservation and motion control in robotics and electric vehicles. (Formerly EE 176L.)",
    "concurrent": "ECE 176",
    "prerequisites": {
      "AND": [
        "ECE 103",
        "ECE 171"
      ]
    },
    "concentration": "Electric Machine Drives"
  },
  "ECE 177": {
    "name": "Power Electronics",
    "credits": 5,
    "label": "ECE",
    "id": "177",
    "genEd": "null",
    "description": "Switch-mode power converter design and analysis. Non-switching power supplies. Electronic power-factor correction. Soft switching. Power-semiconductor devices. Use in energy conservation, renewable energy, lighting, and power transmission. (Formerly EE 177.)",
    "concurrent": "ECE 177L",
    "prerequisites": "ECE 103",
    "concentration": "Power Converter Design"
  },
  "ECE 177L": {
    "name": "Power Electronics Laboratory",
    "credits": 2,
    "label": "ECE",
    "id": "177L",
    "genEd": "null",
    "description": "Buck, boost, buck-boost, flyback, and forward converter design and control.",
    "concurrent": "ECE 177",
    "prerequisites": "ECE 103",
    "concentration": "Power Converter Design"
  },
  "ECE 178": {
    "name": "Device Electronics",
    "credits": 5,
    "label": "ECE",
    "id": "178",
    "genEd": "null",
    "description": "This course reviews the fundamental principles, device's materials, and design and introduces the operation of several semiconductor devices. Topics include the motion of charge carriers in solids, equilibrium statistics, the electronic structure of solids, doping, the pn junction, the junction transistor, the Schottky diode, the field-effect transistor, the light-emitting diode, and the photodiode. (Formerly EE 178.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "ECE 102",
        "ECE 102L",
        "ECE 171",
        "ECE 171L"
      ]
    },
    "concentration": "Semiconductor Devices"
  },
  "ECE 179": {
    "name": "Decision Analysis in Management",
    "credits": 5,
    "label": "ECE",
    "id": "179",
    "genEd": "null",
    "description": "Presents decision tools/theory with a focus on investment, finance, management, technology, and policy. Often, irreversible decisions are made without enough information to analyze the possible consequences. Course uses systematic approaches to analyze these types of situations to enable rational decisions. (CSE 174.)",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        {
          "OR": [
            "AM 30",
            "MATH 22",
            "MATH 23A"
          ]
        },
        "ECON 113",
        {
          "OR": [
            "ECON 100A",
            "ECON 100M"
          ]
        }
      ]
    },
    "concentration": "Decision Analysis"
  },
  "ECE 180J": {
    "name": "Advanced Renewable Energy Sources, Storage, and Smart Grids",
    "credits": 5,
    "label": "ECE",
    "id": "180J",
    "genEd": "PE-E",
    "description": "Provides a comprehensive overview of renewable energy, storage, and smart grids. Fundamental energy-conversion limits based on physics and existing material properties are discussed. Various sources and facilities, such as solar, wind, hydropower, geothermal, tidal energy, and fuel cells are described. Solar- and wind-site assessment, electric vehicles, as well as sustainable microgrids are also discussed. Finally, the latest research on smart grids and smart cities is introduced. Taught in conjunction with course 80J. Students who enroll in this class will learn how to use Matlab to solve engineering problems.(Formerly EE 180J.)",
    "concurrent": "null",
    "prerequisites": {
      "OR": [
        "MATH 3",
        "AM 3",
        "AM 5",
        "AM 7"
      ]
    },
    "concentration": "Renewable Energy"
  },
  "ECE 181J": {
    "name": "Renewable Energy Sources in Practice",
    "credits": 7,
    "label": "ECE",
    "id": "181J",
    "genEd": "null",
    "description": "Provides a comprehensive overview of renewable energy, storage, and smart grids. Fundamental energy-conversion limits based on physics and existing material properties are discussed. Various sources and facilities, such as solar, wind, hydropower, geothermal, tidal energy, and fuel cells are described. Solar- and wind-site assessment, electric vehicles, as well as sustainable microgrids are also discussed. Finally, the latest research on smart grids and smart cities is introduced. Taught in conjunction with course 80J. Students who enroll in this class will learn how to use Matlab to solve engineering problems.(Formerly EE 180J.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Renewable Energy"
  },
  "ECE 183": {
    "name": "Special Topics in Electrical Engineering",
    "credits": 5,
    "label": "ECE",
    "id": "183",
    "genEd": "null",
    "description": "Topics vary with instructor. Sample topics include smart grids, bioelectronics, antennas, etc. Enrollment by instructor permission. Approval of undergraduate adviser required for credit as an upper-division elective. (Formerly EE 183.)",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Special Topics"
  },
  "ECE 185": {
    "name": "Introduction to the US Electricity Industry",
    "credits": 5,
    "label": "ECE",
    "id": "185",
    "genEd": "null",
    "description": "Teaches students about the U.S. electricity industry. Topics include power generation costs, electric grid, power flows, retail market and tariff design, regulation and market monitoring, locational marginal pricing, risk management, market power, and contemporary issues.",
    "concurrent": "null",
    "prerequisites": {
      "AND": [
        "PHYS 5C",
        "PHYS 5N"
      ]
    },
    "concentration": "Electricity Industry"
  },
  "ECE 193": {
    "name": "Field Study",
    "credits": 5,
    "label": "ECE",
    "id": "193",
    "genEd": "null",
    "description": "Provides for individual programs of study with specific academic objectives carried out under the direction of a faculty member of the electrical engineering program and a willing sponsor at the field site and using resources not normally available on campus. Credit is based on the presentation of evidence of achieving the objectives by submitting a written and oral presentation. May not normally be repeated for credit.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  },
  "ECE 193F": {
    "name": "Field Study",
    "credits": 2,
    "label": "ECE",
    "id": "193F",
    "genEd": "null",
    "description": "Provides for individual programs of study with specific academic objectives carried out under the direction of a faculty member of the electrical engineering program and a willing sponsor at the field site and using resources not normally available on campus. Credit is based on the presentation of evidence of achieving the objectives by submitting a written and oral presentation. May not normally be repeated for credit.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  },
  "ECE 195": {
    "name": "Senior Thesis Research",
    "credits": 5,
    "label": "ECE",
    "id": "195",
    "genEd": "null",
    "description": "Individual directed study for upper-division undergraduates. Students submit petition to sponsoring agency. If using this course to replace the capstone design requirement (ECE 129A, ECE129B, ECE 129C), students must take ECE 129A. Prerequisite(s): satisfaction",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  },
  "ECE 195F": {
    "name": "Senior Thesis Research",
    "credits": 2,
    "label": "ECE",
    "id": "195F",
    "genEd": "null",
    "description": "Prerequisite(s): petition on file with sponsoring agency. Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  },
  "ECE 198": {
    "name": "Individual Study or Research",
    "credits": 5,
    "label": "ECE",
    "id": "198",
    "genEd": "null",
    "description": "Provides for department-sponsored individual study program off campus, for which faculty supervision is not in person, but by correspondence. Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  },
  "ECE 198F": {
    "name": "Independent Field Study",
    "credits": 2,
    "label": "ECE",
    "id": "198F",
    "genEd": "null",
    "description": "Provides for department-sponsored individual study program off campus for which faculty supervision is not in person, but by correspondence. Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  },
  "ECE 199": {
    "name": "Tutorial",
    "credits": 5,
    "label": "ECE",
    "id": "199",
    "genEd": "null",
    "description": "Individual directed study for upper-division undergraduates. Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  },
  "ECE 199F": {
    "name": "Tutorial",
    "credits": 2,
    "label": "ECE",
    "id": "199F",
    "genEd": "null",
    "description": "Individual directed study for upper-division undergraduates. Students submit petition to sponsoring agency.",
    "concurrent": "null",
    "prerequisites": {},
    "concentration": "Individual Study"
  }
}